weifengdq/embedded/tc364/0_Board_Test_CAN0/Libraries/Infra/Sfr/TC36x/IfxCbs_regdef.h
/** \brief TG Output Pins Pulse Stretcher */
typedef struct _Ifx_CBS_TOPPS_Bits
{
    Ifx_Strict_32Bit PIN0:2;          /**< \brief [1:0] Pulse Stretch Control for Trigger Pin 0 - PIN0 (rw) */
    Ifx_Strict_32Bit PIN1:2;          /**< \brief [3:2] Pulse Stretch Control for Trigger Pin 1 - PIN1 (rw) */
    Ifx_Strict_32Bit PIN2:2;          /**< \brief [5:4] Pulse Stretch Control for Trigger Pin 2 - PIN2 (rw) */
    Ifx_Strict_32Bit PIN3:2;          /**< \brief [7:6] Pulse Stretch Control for Trigger Pin 3 - PIN3 (rw) */
    Ifx_Strict_32Bit PIN4:2;          /**< \brief [9:8] Pulse Stretch Control for Trigger Pin 4 - PIN4 (rw) */
    Ifx_Strict_32Bit PIN5:2;          /**< \brief [11:10] Pulse Stretch Control for Trigger Pin 5 - PIN5 (rw) */
    Ifx_Strict_32Bit PIN6:2;          /**< \brief [13:12] Pulse Stretch Control for Trigger Pin 6 - PIN6 (rw) */
    Ifx_Strict_32Bit PIN7:2;          /**< \brief [15:14] Pulse Stretch Control for Trigger Pin 7 - PIN7 (rw) */
    Ifx_Strict_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CBS_TOPPS_Bits;

/** \brief TG Output Pins Routing */
typedef struct _Ifx_CBS_TOPR_Bits
{
    Ifx_Strict_32Bit PIN0:4;          /**< \brief [3:0] Trigger Line to Trigger Pin 0 Routing (rw) */
    Ifx_Strict_32Bit PIN1:4;          /**< \brief [7:4] Trigger Line to Trigger Pin 1 Routing (rw) */
    Ifx_Strict_32Bit PIN2:4;          /**< \brief [11:8] Trigger Line to Trigger Pin 2 Routing (rw) */
    Ifx_Strict_32Bit PIN3:4;          /**< \brief [15:12] Trigger Line to Trigger Pin 3 Routing (rw) */
    Ifx_Strict_32Bit PIN4:4;          /**< \brief [19:16] Trigger Line to Trigger Pin 4 Routing (rw) */
    Ifx_Strict_32Bit PIN5:4;          /**< \brief [23:20] Trigger Line to Trigger Pin 5 Routing (rw) */
    Ifx_Strict_32Bit PIN6:4;          /**< \brief [27:24] Trigger Line to Trigger Pin 6 Routing (rw) */
    Ifx_Strict_32Bit PIN7:4;          /**< \brief [31:28] Trigger Line to Trigger Pin 7 Routing (rw) */
} Ifx_CBS_TOPR_Bits;

/** \brief TG Routing for CPU${x} */
typedef struct _Ifx_CBS_TRC_Bits
{
    Ifx_Strict_32Bit HALT:4;          /**< \brief [3:0] HALT to Trigger Line Routing - HALT (rw) */
    Ifx_Strict_32Bit BRKOUT:4;        /**< \brief [7:4] BRKOUT to Trigger Line Routing - BRKOUT (rw) */
    Ifx_Strict_32Bit BT1:1;           /**< \brief [8:8] BRKOUT to Trigger Line 1 Routing - BT1 (rw) */
    Ifx_Strict_32Bit reserved_9:11;    /**< \brief [19:9] \internal Reserved */
    Ifx_Strict_32Bit BRKIN:4;         /**< \brief [23:20] Trigger Line to BRKIN Routing - BRKIN (rw) */
    Ifx_Strict_32Bit SUSIN:4;         /**< \brief [27:24] Trigger Line to SUSIN Routing - SUSIN (rw) */
    Ifx_Strict_32Bit reserved_28:4;    /**< \brief [31:28] \internal Reserved */
} Ifx_CBS_TRC_Bits;

/** \brief TG Routing Events of CPU${x} */
typedef struct _Ifx_CBS_TREC_Bits
{
    Ifx_Strict_32Bit TR0EV:4;         /**< \brief [3:0] TRxEVT to Trigger Line Routing TR0EV (rw) */
    Ifx_Strict_32Bit reserved_4:4;    /**< \brief [7:4] \internal Reserved */
    Ifx_Strict_32Bit TR2EV:4;         /**< \brief [11:8] TRxEVT to Trigger Line Routing TR2EV (rw) */
    Ifx_Strict_32Bit reserved_12:4;    /**< \brief [15:12] \internal Reserved */
    Ifx_Strict_32Bit TR4EV:4;         /**< \brief [19:16] TRxEVT to Trigger Line Routing TR4EV (rw) */
    Ifx_Strict_32Bit reserved_20:4;    /**< \brief [23:20] \internal Reserved */
    Ifx_Strict_32Bit TR6EV:4;         /**< \brief [27:24] TRxEVT to Trigger Line Routing TR6EV (rw) */
    Ifx_Strict_32Bit reserved_28:4;    /**< \brief [31:28] \internal Reserved */
} Ifx_CBS_TREC_Bits;

/** \brief TG Routing for HSMControl */
typedef struct _Ifx_CBS_TRHSM_Bits
{
    Ifx_Strict_32Bit HALT:4;          /**< \brief [3:0] HALT to Trigger Line Routing - HALT (rw) */
    Ifx_Strict_32Bit BRKOUT:4;        /**< \brief [7:4] BRKOUT to Trigger Line Routing - BRKOUT (rw) */
    Ifx_Strict_32Bit BT1:1;           /**< \brief [8:8] BRKOUT to Trigger Line 1 Routing - BT1 (rw) */
    Ifx_Strict_32Bit reserved_9:11;    /**< \brief [19:9] \internal Reserved */
    Ifx_Strict_32Bit BRKIN:4;         /**< \brief [23:20] Trigger Line to BRKIN Routing - BRKIN (rw) */
    Ifx_Strict_32Bit SUSIN:4;         /**< \brief [27:24] Trigger Line to SUSIN Routing - SUSIN (rw) */
    Ifx_Strict_32Bit reserved_28:4;    /**< \brief [31:28] \internal Reserved */
} Ifx_CBS_TRHSM_Bits;

/** \brief Trigger to Host Register ${x} */
typedef struct _Ifx_CBS_TRIG_Bits
{
    Ifx_UReg_32Bit TRGX_0:1;          /**< \brief [0:0] Service Request Bits - TRGx_0 (rh) */
    Ifx_UReg_32Bit TRGX_1:1;          /**< \brief [1:1] Service Request Bits - TRGx_1 (rh) */
    Ifx_UReg_32Bit TRGX_2:1;          /**< \brief [2:2] Service Request Bits - TRGx_2 (rh) */
    Ifx_UReg_32Bit TRGX_3:1;          /**< \brief [3:3] Service Request Bits - TRGx_3 (rh) */
    Ifx_UReg_32Bit TRGX_4:1;          /**< \brief [4:4] Service Request Bits - TRGx_4 (rh) */
    Ifx_UReg_32Bit TRGX_5:1;          /**< \brief [5:5] Service Request Bits - TRGx_5 (rh) */
    Ifx_UReg_32Bit TRGX_6:1;          /**< \brief [6:6] Service Request Bits - TRGx_6 (rh) */
    Ifx_UReg_32Bit TRGX_7:1;          /**< \brief [7:7] Service Request Bits - TRGx_7 (rh) */
    Ifx_UReg_32Bit TRGX_8:1;          /**< \brief [8:8] Service Request Bits - TRGx_8 (rh) */
    Ifx_UReg_32Bit TRGX_9:1;          /**< \brief [9:9] Service Request Bits - TRGx_9 (rh) */
    Ifx_UReg_32Bit TRGX_10:1;         /**< \brief [10:10] Service Request Bits - TRGx_10 (rh) */
    Ifx_UReg_32Bit TRGX_11:1;         /**< \brief [11:11] Service Request Bits - TRGx_11 (rh) */
    Ifx_UReg_32Bit TRGX_12:1;         /**< \brief [12:12] Service Request Bits - TRGx_12 (rh) */
    Ifx_UReg_32Bit TRGX_13:1;         /**< \brief [13:13] Service Request Bits - TRGx_13 (rh) */
    Ifx_UReg_32Bit TRGX_14:1;         /**< \brief [14:14] Service Request Bits - TRGx_14 (rh) */
    Ifx_UReg_32Bit TRGX_15:1;         /**< \brief [15:15] Service Request Bits - TRGx_15 (rh) */
    Ifx_UReg_32Bit reserved_16:8;     /**< \brief [23:16] \internal Reserved */
    Ifx_UReg_32Bit X:8;               /**< \brief [31:24] TRIG register number - x (rh) */
} Ifx_CBS_TRIG_Bits;

/** \brief Clear Trigger to Host Register */
typedef struct _Ifx_CBS_TRIGC_Bits
{
    Ifx_UReg_32Bit TRGX_0:1;          /**< \brief [0:0] Request Bits of most important register TRIGx - TRGx_0 (rh) */
    Ifx_UReg_32Bit TRGX_1:1;          /**< \brief [1:1] Request Bits of most important register TRIGx - TRGx_1 (rh) */
    Ifx_UReg_32Bit TRGX_2:1;          /**< \brief [2:2] Request Bits of most important register TRIGx - TRGx_2 (rh) */
    Ifx_UReg_32Bit TRGX_3:1;          /**< \brief [3:3] Request Bits of most important register TRIGx - TRGx_3 (rh) */
    Ifx_UReg_32Bit TRGX_4:1;          /**< \brief [4:4] Request Bits of most important register TRIGx - TRGx_4 (rh) */
    Ifx_UReg_32Bit TRGX_5:1;          /**< \brief [5:5] Request Bits of most important register TRIGx - TRGx_5 (rh) */
    Ifx_UReg_32Bit TRGX_6:1;          /**< \brief [6:6] Request Bits of most important register TRIGx - TRGx_6 (rh) */
    Ifx_UReg_32Bit TRGX_7:1;          /**< \brief [7:7] Request Bits of most important register TRIGx - TRGx_7 (rh) */
    Ifx_UReg_32Bit TRGX_8:1;          /**< \brief [8:8] Request Bits of most important register TRIGx - TRGx_8 (rh) */
    Ifx_UReg_32Bit TRGX_9:1;          /**< \brief [9:9] Request Bits of most important register TRIGx - TRGx_9 (rh) */
    Ifx_UReg_32Bit TRGX_10:1;         /**< \brief [10:10] Request Bits of most important register TRIGx - TRGx_10 (rh) */
    Ifx_UReg_32Bit TRGX_11:1;         /**< \brief [11:11] Request Bits of most important register TRIGx - TRGx_11 (rh) */
    Ifx_UReg_32Bit TRGX_12:1;         /**< \brief [12:12] Request Bits of most important register TRIGx - TRGx_12 (rh) */
    Ifx_UReg_32Bit TRGX_13:1;         /**< \brief [13:13] Request Bits of most important register TRIGx - TRGx_13 (rh) */
    Ifx_UReg_32Bit TRGX_14:1;         /**< \brief [14:14] Request Bits of most important register TRIGx - TRGx_14 (rh) */
    Ifx_UReg_32Bit TRGX_15:1;         /**< \brief [15:15] Request Bits of most important register TRIGx - TRGx_15 (rh) */
    Ifx_UReg_32Bit reserved_16:8;     /**< \brief [23:16] \internal Reserved */
    Ifx_UReg_32Bit X:8;               /**< \brief [31:24] Index of most important register TRIGx - x (rh) */
} Ifx_CBS_TRIGC_Bits;

/** \brief Set Trigger to Host Register */
typedef struct _Ifx_CBS_TRIGS_Bits
{
    Ifx_Strict_32Bit BITNUM:8;        /**< \brief [7:0] Service Request Bit Number to Set - BITNUM (w) */
    Ifx_Strict_32Bit reserved_8:24;    /**< \brief [31:8] \internal Reserved */
} Ifx_CBS_TRIGS_Bits;

